python/base/对象持久话与pickle模块.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>对象持久话与pickle模块</title>
<!-- 2015-12-15 二 19:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="huihui" />
</head>
<body>
<div id="content">
<h1 class="title">对象持久话与pickle模块</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 什么是持久性</a></li>
<li><a href="#sec-2">2. 对象持久性的几种模式</a>
<ul>
<li><a href="#sec-2-1">2.1. 对象-关系映射（ORM）</a></li>
<li><a href="#sec-2-2">2.2. 主动域对象模式</a></li>
<li><a href="#sec-2-3">2.3. JDO模式</a></li>
<li><a href="#sec-2-4">2.4. CMP 模式</a></li>
</ul>
</li>
<li><a href="#sec-3">3. python的对象持久性</a></li>
<li><a href="#sec-4">4. 一些经过pickle的 Python</a></li>
<li><a href="#sec-5">5. Pickle 的威力</a>
<ul>
<li><a href="#sec-5-1">5.1. 可移植性</a></li>
<li><a href="#sec-5-2">5.2. 多个引用，同一对象</a></li>
<li><a href="#sec-5-3">5.3. 循环引用和递归引用</a></li>
<li><a href="#sec-5-4">5.4. 想等但不相同</a></li>
<li><a href="#sec-5-5">5.5. 不可 pickle 的对象</a></li>
<li><a href="#sec-5-6">5.6. 类实例</a></li>
<li><a href="#sec-5-7">5.7. 特殊的状态方法</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 模式改进</a>
<ul>
<li><a href="#sec-6-1">6.1. 类名的更改</a></li>
<li><a href="#sec-6-2">6.2. 属性的添加和删除</a></li>
<li><a href="#sec-6-3">6.3. 模块的修改</a></li>
</ul>
</li>
<li><a href="#sec-7">7. 结束语</a></li>
<li><a href="#sec-8">8. 参考资料</a>
<ul>
<li><a href="#sec-8-1">8.1. 本文参考</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 什么是持久性</h2>
<div class="outline-text-2" id="text-1">
<p>
持久性的基本思想很简单。假定有一个 Python 程序，它可能是一个管理日常待办事项的程序，您希望在多次执行这个程序之间可以保存应用程序对象（待办事项）。换句话说，您希望将对象存储在磁盘上，便于以后检索。
这就是持久性。要达到这个目的，有几种方法，每一种方法都有其优缺点
</p>

<p>
例如，可以将对象数据存储在某种格式的文本文件中，譬如 CSV 文件。或者可以用关系数据库，譬如 Gadfly、MySQL
、PostgreSQL 或者 DB2。这些文件格式和数据库都非常优秀，对于所有这些存储机制，Python 都有健壮的接口。
</p>

<p>
这些存储机制都有一个共同点：存储的数据是独立于对这些数据进行操作的对象和程序。这样做的好处是，数据可以作为共享的资源，供其它应用程序使用。缺点是，用这种方式，可以允许其它程序访问对象的数据，
这违背了面向对象的封装性原则 — 即对象的数据只能通过这个对象自身的公共（public）接口来访问
</p>

<p>
另外，对于某些应用程序，关系数据库方法可能不是很理想。尤其是，关系数据库不理解对象。相反，关系数据库会强行使用自己的类型系统和关系数据模型（表），每张表包含一组元组（行），每行包含具有固定数目
的静态类型字段（列）。如果应用程序的对象模型不能够方便地转换到关系模型，那么在将对象映射到元组以及将元组映射回对象方面，会碰到一定难度。这种困难常被称为阻碍性不匹配（impedence-mismatch）问题。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 对象持久性的几种模式</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 对象-关系映射（ORM）</h3>
<div class="outline-text-3" id="text-2-1">
<p>
ORM-Object/Relational Mapper，即对象-关系型数据映射组件。对于O/R，即 Object（对象）和 Relational（关系型数据），表示必须同时使用面向对象和关系型数据进行开发。ORM解决的主要问题就是
对象-关系的映射。一般情况下，一个持久化类和一个表对应，类的每个实例与表中的一条记录对应。
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 主动域对象模式</h3>
<div class="outline-text-3" id="text-2-2">
<p>
在它的实现中封装了关系数据模型和数据访问细节。在 J2EE 架构中，EJB 组件分为会话 EJB 和实体 EJB。会话 EJB 通常实现业务逻辑，而实体 EJB 表示业务实体。实体 EJB 又分为两种：
由 EJB 本身管理持久化，即 BMP（Bean-Managed Persistence）；有 EJB 容器管理持久化，即 CMP（Container-Managed Persistence）。BMP就是主动域对象模式的一个例子，
BMP 表示由实体 EJB 自身管理数据访问细节。
</p>

<p>
主动域对象本身位于业务逻辑层，因此采用主动域对象模式时，整个应用仍然是三层应用结构，并没有从业务逻辑层分离出独立的持久化层。
</p>

<ul class="org-ul">
<li>优点:
<ol class="org-ol">
<li>在实体域对象中封装自身的数据访问细节，过程域对象完全负责业务逻辑，使程序结构更加清晰。
</li>
<li>如果关系数据模型发生改变，只需修改主动域对象的代码，不需要修改过程域对象的业务方法。
</li>
</ol>
</li>

<li>缺点：
<ol class="org-ol">
<li>在实体域对象的实现中仍然包含SQL语句。
</li>
<li>每个实体域对象都负责自身的数据访问实现。把这一职责分散、在多个对象中，这会导致实体域对象重复实现一些共同的数据访问操作，造成重复编码。
</li>
</ol>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> JDO模式</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Java Data Objects（JDO）是 SUN 公司制定的描述对象持久化语义的标准API。严格的说，JDO 并不是对象-关系映射接口，因为它支持把对象持久化到任意一种存储系统中，
包括 关系数据库、面向对象的数据库、基于 XML 的数据库，以及其他专有存储系统。由于关系数据库是目前最流行的存储系统，许多 JDO 的实现都包含了对象-关系映射服务
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> CMP 模式</h3>
<div class="outline-text-3" id="text-2-4">
<p>
在 J2EE 架构中，CMP（Container-Managed Persistence）表示由 EJB 容器来管理实体 EJB 的持久化，EJB 容器封装了对象-关系的映射及数据访问细节。CMP 和 ORM 的相似之处在于，
两者都提供对象-关系映射服务，都把对象持久化的任务从业务逻辑中分离出来。区别在于 CMP 负责持久化实体 EJB 组件，而 ORM 负责持久化 POJO，它是普通的基于 Java Bean 形式的实体域对象。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> python的对象持久性</h2>
<div class="outline-text-2" id="text-3">
<p>
如果希望透明地存储 Python 对象，而不丢失其身份和类型等信息，则需要某种形式的对象序列化：它是一个将任意复杂的对象转成对象的文本或二进制表示的过程。同样，必须能够将对象经过序列化后的形式恢复到原有的对象。
在 Python 中，这种序列化过程称为 pickle，可以将对象 pickle 成字符串、磁盘上的文件或者任何类似于文件的对象，也可以将这些字符串、文件或任何类似于文件的对象 unpickle 成原来的对象。
我们将在本文后面详细讨论 pickle。
</p>

<p>
假定您喜欢将任何事物都保存成对象，而且希望避免将对象转换成某种基于非对象存储的开销；那么 pickle 文件可以提供这些好处，但有时可能需要比这种简单的 pickle 文件更健壮以及更具有可伸缩性的事物。
例如，只用 pickle 不能解决命名和查找 pickle 文件这样的问题，另外，它也不能支持并发地访问持久性对象。如果需要这些方面的功能，则要求助类似于 ZODB（针对 Python 的 Z 对象数据库）这类数据库。
ZODB 是一个健壮的、多用户的和面向对象的数据库系统，它能够存储和管理任意复杂的 Python 对象，并支持事务操作和并发控制。（请参阅 参考资料，以下载 ZODB。）令人足够感兴趣的是，甚至 ZODB 也依靠
 Python 的本机序列化能力，而且要有效地使用 ZODB，必须充分了解 pickle。
</p>

<p>
另一种令人感兴趣的解决持久性问题的方法是 Prevayler，它最初是用 Java 实现的（有关 Prevaylor 方面的 developerWorks 文章，请参阅 参考资料）。最近，一群 Python 程序员将 Prevayler 移植到了
Python 上，另起名为 PyPerSyst，由 SourceForge 托管（有关至 PyPerSyst 项目的链接，请参阅 参考资料）。Prevayler/PyPerSyst 概念也是建立在 Java 和 Python 语言的本机序列化能力之上。
PyPerSyst 将整个对象系统保存在内存中，并通过不时地将系统快照 pickle 到磁盘以及维护一个命令日志（通过此日志可以重新应用最新的快照）来提供灾难恢复。所以，尽管使用 PyPerSyst 的应用程序受到可用内存的限制，
但好处是本机对象系统可以完全装入到内存中，因而速度极快，而且实现起来要比如 ZODB 这样的数据库简单，ZODB 允许对象的数目比同时在能内存中所保持的对象要多。
</p>

<p>
既然我们已经简要讨论了存储持久对象的各种方法，那么现在该详细探讨 pickle 过程了。虽然我们主要感兴趣的是探索以各种方式来保存 Python 对象，而不必将其转换成某种其它格式，但我们仍然还有一些需要关注的地方，
譬如：如何有效地 pickle 和 unpickle 简单对象以及复杂对象，包括定制类的实例；如何维护对象的引用，包括循环引用和递归引用；以及如何处理类定义发生的变化，从而使用以前经过 pickle 的实例时不会发生问题。
我们将在随后关于 Python 的 pickle 能力探讨中涉及所有这些问题。
</p>
</div>
</div>
