python/base/对象持久话与pickle模块.html



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 一些经过pickle的 Python</h2>
<div class="outline-text-2" id="text-4">
<p>
pickle 模块及其同类模块 cPickle 向 Python 提供了 pickle 支持。后者是用 C 编码的，它具有更好的性能，对于大多数应用程序，推荐使用该模块。我们将继续讨论 pickle ，但本文的示例实际是利用了 cPickle 。
由于其中大多数示例要用 Python shell 来显示，所以先展示一下如何导入 cPickle ，并可以作为 pickle 来引用它：
</p>

<pre class="example">
&gt;&gt;&gt; import cPickle as pickle
</pre>

<p>
现在已经导入了该模块，接下来让我们看一下 pickle 接口。 pickle 模块提供了以下函数对： 
</p>
<ul class="org-ul">
<li>dumps(object) 返回一个字符串，它包含一个 pickle 格式的对象； 
</li>
<li>loads(string) 返回包含在 pickle 字符串中的对象； 
</li>
<li>dump(object, file) 将对象写到文件，这个文件可以是实际的物理文件，但也可以是任何类似于文件的对象，这个对象具有 write() 方法，可以接受单个的字符串参数； 
</li>
<li>load(file) 返回包含在 pickle 文件中的对象。
</li>
</ul>


<p>
缺省情况下， dumps() 和 dump() 使用可打印的 ASCII 表示来创建 pickle。两者都有一个 final 参数（可选），如果为 True ，则该参数指定用更快以及更小的二进制表示来创建 pickle。 
loads() 和 load() 函数自动检测 pickle 是二进制格式还是文本格式。
</p>


<p>
清单 1 显示了一个交互式会话，这里使用了刚才所描述的 dumps() 和 loads() 函数
</p>
<div class="org-src-container">

<pre class="src src-python">Welcome To PyCrust <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">7</span>.<span style="color: #a45bad;">2</span> - The Flakiest Python Shell
Sponsored by Orbtech - Your source <span style="color: #237fbf; font-weight: bold;">for</span> Python programming expertise.
Python <span style="color: #a45bad;">2</span>.<span style="color: #a45bad;">2</span>.<span style="color: #a45bad;">1</span> <span style="color: #2f96dc;">(</span><span style="color: #2aa198;">#</span><span style="color: #2aa198;">1, Aug 27 2002, 10:22:32)</span>
<span style="color: #bc6ec5;">[</span>GCC <span style="color: #a45bad;">3</span>.<span style="color: #a45bad;">2</span> <span style="color: #2aa198;">(</span>Mandrake Linux <span style="color: #a45bad;">9</span>.<span style="color: #a45bad;">0</span> <span style="color: #a45bad;">3</span>.<span style="color: #a45bad;">2</span>-<span style="color: #a45bad;">1mdk</span><span style="color: #2aa198;">)</span><span style="color: #bc6ec5;">]</span> on linux-i386
Type <span style="color: #2aa198;">"copyright"</span>, <span style="color: #2aa198;">"credits"</span> <span style="color: #237fbf; font-weight: bold;">or</span> <span style="color: #2aa198;">"license"</span> <span style="color: #237fbf; font-weight: bold;">for</span> more information.
&gt;&gt;&gt; <span style="color: #237fbf; font-weight: bold;">import</span> cPickle <span style="color: #237fbf; font-weight: bold;">as</span> pickle
&gt;&gt;&gt; t1 = <span style="color: #bc6ec5;">(</span><span style="color: #2aa198;">'this is a string'</span>, <span style="color: #a45bad;">42</span>, <span style="color: #2aa198;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span><span style="color: #2aa198;">]</span>, <span style="color: #a45bad;">None</span><span style="color: #bc6ec5;">)</span>
&gt;&gt;&gt; t1
<span style="color: #bc6ec5;">(</span><span style="color: #2aa198;">'this is a string'</span>, <span style="color: #a45bad;">42</span>, <span style="color: #2aa198;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span><span style="color: #2aa198;">]</span>, <span style="color: #a45bad;">None</span><span style="color: #bc6ec5;">)</span>
&gt;&gt;&gt; p1 = pickle.dumps<span style="color: #bc6ec5;">(</span>t1<span style="color: #bc6ec5;">)</span>
&gt;&gt;&gt; p1
<span style="color: #2aa198;">"(S'this is a string'\nI42\n(lp1\nI1\naI2\naI3\naNtp2\n."</span>
&gt;&gt;&gt; <span style="color: #237fbf; font-weight: bold;">print</span> p1
<span style="color: #bc6ec5;">(</span>S<span style="color: #2aa198;">'this is a string'</span>
I42
<span style="color: #2aa198;">(</span>lp1
I1
aI2
aI3
aNtp2
.
&gt;&gt;&gt; t2 = pickle.loads<span style="color: #67b11d;">(</span>p1<span style="color: #67b11d;">)</span>
&gt;&gt;&gt; t2
<span style="color: #67b11d;">(</span><span style="color: #2aa198;">'this is a string'</span>, <span style="color: #a45bad;">42</span>, <span style="color: #b1951d;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span><span style="color: #b1951d;">]</span>, <span style="color: #a45bad;">None</span><span style="color: #67b11d;">)</span>
&gt;&gt;&gt; p2 = pickle.dumps<span style="color: #67b11d;">(</span>t1, <span style="color: #a45bad;">True</span><span style="color: #67b11d;">)</span>
&gt;&gt;&gt; p2
<span style="color: #2aa198;">'(U\x10this is a stringK*]q\x01(K\x01K\x02K\x03eNtq\x02.'</span>
&gt;&gt;&gt; t3 = pickle.loads<span style="color: #67b11d;">(</span>p2<span style="color: #67b11d;">)</span>
&gt;&gt;&gt; t3
<span style="color: #67b11d;">(</span><span style="color: #2aa198;">'this is a string'</span>, <span style="color: #a45bad;">42</span>, <span style="color: #b1951d;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span><span style="color: #b1951d;">]</span>, <span style="color: #a45bad;">None</span><span style="color: #67b11d;">)</span>
</pre>
</div>

<p>
注：该文本 pickle 格式很简单，这里就不解释了。事实上，在 pickle 模块中记录了所有使用的约定。我们还应该指出，在我们的示例中使用的都是简单对象，因此使用二进制 pickle 格式不会在节省空间上显示出太大的效率。
然而，在实际使用复杂对象的系统中，您会看到，使用二进制格式可以在大小和速度方面带来显著的改进。
</p>

<p>
接下来，我们看一些示例，这些示例用到了 dump() 和 load() ，它们使用文件和类似文件的对象。这些函数的操作非常类似于我们刚才所看到的 dumps() 和 loads() ，
区别在于它们还有另一种能力 — dump() 函数能一个接着一个地将几个对象转储到同一个文件。随后调用 load() 来以同样的顺序检索这些对象。清单 2 显示了这种能力的实际应用：
</p>

<p>
清单 2. dump() 和 load() 示例
</p>
<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #adaab3;">a1</span> = <span style="color: #2aa198;">'apple'</span>
&gt;&gt;&gt; <span style="color: #adaab3;">b1</span> = <span style="color: #2f96dc;">{</span><span style="color: #a45bad;">1</span>: <span style="color: #2aa198;">'One'</span>, <span style="color: #a45bad;">2</span>: <span style="color: #2aa198;">'Two'</span>, <span style="color: #a45bad;">3</span>: <span style="color: #2aa198;">'Three'</span><span style="color: #2f96dc;">}</span>
&gt;&gt;&gt; <span style="color: #adaab3;">c1</span> = <span style="color: #2f96dc;">[</span><span style="color: #2aa198;">'fee'</span>, <span style="color: #2aa198;">'fie'</span>, <span style="color: #2aa198;">'foe'</span>, <span style="color: #2aa198;">'fum'</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; <span style="color: #adaab3;">f1</span> = <span style="color: #1f71ab;">file</span><span style="color: #2f96dc;">(</span><span style="color: #2aa198;">'temp.pkl'</span>, <span style="color: #2aa198;">'wb'</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; pickle.dump<span style="color: #2f96dc;">(</span>a1, f1, <span style="color: #a45bad;">True</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; pickle.dump<span style="color: #2f96dc;">(</span>b1, f1, <span style="color: #a45bad;">True</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; pickle.dump<span style="color: #2f96dc;">(</span>c1, f1, <span style="color: #a45bad;">True</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; f1.close<span style="color: #2f96dc;">()</span>
&gt;&gt;&gt; <span style="color: #adaab3;">f2</span> = <span style="color: #1f71ab;">file</span><span style="color: #2f96dc;">(</span><span style="color: #2aa198;">'temp.pkl'</span>, <span style="color: #2aa198;">'rb'</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; <span style="color: #adaab3;">a2</span> = pickle.load<span style="color: #2f96dc;">(</span>f2<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; a2
<span style="color: #2aa198;">'apple'</span>
&gt;&gt;&gt; <span style="color: #adaab3;">b2</span> = pickle.load<span style="color: #2f96dc;">(</span>f2<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; b2
<span style="color: #2f96dc;">{</span><span style="color: #a45bad;">1</span>: <span style="color: #2aa198;">'One'</span>, <span style="color: #a45bad;">2</span>: <span style="color: #2aa198;">'Two'</span>, <span style="color: #a45bad;">3</span>: <span style="color: #2aa198;">'Three'</span><span style="color: #2f96dc;">}</span>
&gt;&gt;&gt; <span style="color: #adaab3;">c2</span> = pickle.load<span style="color: #2f96dc;">(</span>f2<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; c2
<span style="color: #2f96dc;">[</span><span style="color: #2aa198;">'fee'</span>, <span style="color: #2aa198;">'fie'</span>, <span style="color: #2aa198;">'foe'</span>, <span style="color: #2aa198;">'fum'</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; f2.close<span style="color: #2f96dc;">()</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Pickle 的威力</h2>
<div class="outline-text-2" id="text-5">
<p>
到目前为止，我们讲述了关于 pickle 方面的基本知识。在这一节，将讨论一些高级问题，当您开始 pickle 复杂对象时，会遇到这些问题，其中包括定制类的实例。幸运的是，Python 可以很容易地处理这种情形。
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 可移植性</h3>
<div class="outline-text-3" id="text-5-1">
<p>
从空间和时间上说，Pickle 是可移植的。换句话说，pickle 文件格式独立于机器的体系结构，这意味着，例如，可以在 Linux 下创建一个 pickle，然后将它发送到在 Windows 或 Mac OS 下运行的 Python 程序。
并且，当升级到更新版本的 Python 时，不必担心可能要废弃已有的 pickle。Python 开发人员已经保证 pickle 格式将可以向后兼容 Python 各个版本。
事实上，在 pickle 模块中提供了有关目前以及所支持的格式方面的详细信息：
</p>

<p>
清单 3. 检索所支持的格式
</p>
<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; pickle.format_version
<span style="color: #2aa198;">'1.3'</span>
&gt;&gt;&gt; pickle.compatible_formats
<span style="color: #2f96dc;">[</span><span style="color: #2aa198;">'1.0'</span>, <span style="color: #2aa198;">'1.1'</span>, <span style="color: #2aa198;">'1.2'</span><span style="color: #2f96dc;">]</span>
</pre>
</div>
</div>
</div>
