python/base/对象持久话与pickle模块.html

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 多个引用，同一对象</h3>
<div class="outline-text-3" id="text-5-2">
<p>
在 Python 中，变量是对象的引用。同时，也可以用多个变量引用同一个对象。经证明，Python 在用经过 pickle 的对象维护这种行为方面丝毫没有困难，如清单 4 所示：
</p>

<p>
清单 4. 对象引用的维护
</p>
<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #adaab3;">a</span> = <span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; <span style="color: #adaab3;">b</span> = a
&gt;&gt;&gt; a
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; b
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; a.append<span style="color: #2f96dc;">(</span><span style="color: #a45bad;">4</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; a
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; b
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; <span style="color: #adaab3;">c</span> = pickle.dumps<span style="color: #2f96dc;">(</span><span style="color: #bc6ec5;">(</span>a, b<span style="color: #bc6ec5;">)</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; <span style="color: #adaab3;">d</span>, <span style="color: #adaab3;">e</span> = pickle.loads<span style="color: #2f96dc;">(</span>c<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; d
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; e
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; d.append<span style="color: #2f96dc;">(</span><span style="color: #a45bad;">5</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; d
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; e
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span><span style="color: #2f96dc;">]</span>
</pre>
</div>
</div>
</div>
