python/base/对象持久话与pickle模块.html

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> 循环引用和递归引用</h3>
<div class="outline-text-3" id="text-5-3">
<p>
可以将刚才演示过的对象引用支持扩展到 循环引用（两个对象各自包含对对方的引用）和 递归引用（一个对象包含对其自身的引用）。下面两个清单着重显示这种能力。我们先看一下递归引用：
</p>

<p>
清单 5. 递归引用
</p>
<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #adaab3;">l</span> = <span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; l.append<span style="color: #2f96dc;">(</span>l<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; l
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #bc6ec5;">[</span>...<span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; l<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">3</span><span style="color: #2f96dc;">]</span>
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #bc6ec5;">[</span>...<span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; l<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">3</span><span style="color: #2f96dc;">][</span><span style="color: #a45bad;">3</span><span style="color: #2f96dc;">]</span>
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #bc6ec5;">[</span>...<span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; <span style="color: #adaab3;">p</span> = pickle.dumps<span style="color: #2f96dc;">(</span>l<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; <span style="color: #adaab3;">l2</span> = pickle.loads<span style="color: #2f96dc;">(</span>p<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; l2
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #bc6ec5;">[</span>...<span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; l2<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">3</span><span style="color: #2f96dc;">]</span>
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #bc6ec5;">[</span>...<span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; l2<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">3</span><span style="color: #2f96dc;">][</span><span style="color: #a45bad;">3</span><span style="color: #2f96dc;">]</span>
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #bc6ec5;">[</span>...<span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
</pre>
</div>

<p>
现在，看一个循环引用的示例：
</p>


<p>
清单 6. 循环引用
</p>
<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #adaab3;">a</span> = <span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; <span style="color: #adaab3;">b</span> = <span style="color: #2f96dc;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; a.append<span style="color: #2f96dc;">(</span>b<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; a
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; b.append<span style="color: #2f96dc;">(</span>a<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; a
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #2aa198;">[</span>...<span style="color: #2aa198;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; b
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #2aa198;">[</span>...<span style="color: #2aa198;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; a<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span>
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #2aa198;">[</span>...<span style="color: #2aa198;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; b<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span>
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #2aa198;">[</span>...<span style="color: #2aa198;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; a<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span> <span style="color: #237fbf; font-weight: bold;">is</span> b
<span style="color: #a45bad;">1</span>
&gt;&gt;&gt; b<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span> <span style="color: #237fbf; font-weight: bold;">is</span> a
<span style="color: #a45bad;">1</span>
&gt;&gt;&gt; <span style="color: #adaab3;">f</span> = <span style="color: #1f71ab;">file</span><span style="color: #2f96dc;">(</span><span style="color: #2aa198;">'temp.pkl'</span>, <span style="color: #2aa198;">'w'</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; pickle.dump<span style="color: #2f96dc;">(</span><span style="color: #bc6ec5;">(</span>a, b<span style="color: #bc6ec5;">)</span>, f<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; f.close<span style="color: #2f96dc;">()</span>
&gt;&gt;&gt; <span style="color: #adaab3;">f</span> = <span style="color: #1f71ab;">file</span><span style="color: #2f96dc;">(</span><span style="color: #2aa198;">'temp.pkl'</span>, <span style="color: #2aa198;">'r'</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; <span style="color: #adaab3;">c</span>, <span style="color: #adaab3;">d</span> = pickle.load<span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; f.close<span style="color: #2f96dc;">()</span>
&gt;&gt;&gt; c
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #2aa198;">[</span>...<span style="color: #2aa198;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; d
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #2aa198;">[</span>...<span style="color: #2aa198;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; c<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span>
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #2aa198;">[</span>...<span style="color: #2aa198;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; d<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span>
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #2aa198;">[</span>...<span style="color: #2aa198;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; c<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span> <span style="color: #237fbf; font-weight: bold;">is</span> d
<span style="color: #a45bad;">1</span>
&gt;&gt;&gt; d<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span> <span style="color: #237fbf; font-weight: bold;">is</span> c
<span style="color: #a45bad;">1</span>
</pre>
</div>

<p>
注意，如果分别 pickle 每个对象，而不是在一个元组中一起 pickle 所有对象，会得到略微不同（但很重要）的结果，如清单 7 所示：
</p>

<p>
清单 7. 分别 pickle vs. 在一个元组中一起 pickle
</p>

<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #adaab3;">f</span> = <span style="color: #1f71ab;">file</span><span style="color: #2f96dc;">(</span><span style="color: #2aa198;">'temp.pkl'</span>, <span style="color: #2aa198;">'w'</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; pickle.dump<span style="color: #2f96dc;">(</span>a, f<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; pickle.dump<span style="color: #2f96dc;">(</span>b, f<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; f.close<span style="color: #2f96dc;">()</span>
&gt;&gt;&gt; <span style="color: #adaab3;">f</span> = <span style="color: #1f71ab;">file</span><span style="color: #2f96dc;">(</span><span style="color: #2aa198;">'temp.pkl'</span>, <span style="color: #2aa198;">'r'</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; <span style="color: #adaab3;">c</span> = pickle.load<span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; <span style="color: #adaab3;">d</span> = pickle.load<span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; f.close<span style="color: #2f96dc;">()</span>
&gt;&gt;&gt; c
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #2aa198;">[</span>...<span style="color: #2aa198;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; d
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #2aa198;">[</span>...<span style="color: #2aa198;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; c<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span>
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #2aa198;">[</span>...<span style="color: #2aa198;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; d<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span>
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #2aa198;">[</span>...<span style="color: #2aa198;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; c<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span> <span style="color: #237fbf; font-weight: bold;">is</span> d
<span style="color: #a45bad;">0</span>
&gt;&gt;&gt; d<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">2</span><span style="color: #2f96dc;">]</span> <span style="color: #237fbf; font-weight: bold;">is</span> c
<span style="color: #a45bad;">0</span>
</pre>
</div>
</div>
</div>
