python/base/对象持久话与pickle模块.html

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> 想等但不相同</h3>
<div class="outline-text-3" id="text-5-4">
<p>
正如在上一个示例所暗示的，只有在这些对象引用内存中同一个对象时，它们才是相同的。在 pickle 情形中，每个对象被恢复到一个与原来对象相等的对象，但不是同一个对象。换句话说，每个 pickle 都是原来对象的一个副本：
</p>

<p>
清单 8. 作为原来对象副本的被恢复的对象
</p>
<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #adaab3;">j</span> = <span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; <span style="color: #adaab3;">k</span> = j
&gt;&gt;&gt; k <span style="color: #237fbf; font-weight: bold;">is</span> j
<span style="color: #a45bad;">1</span>
&gt;&gt;&gt; <span style="color: #adaab3;">x</span> = pickle.dumps<span style="color: #2f96dc;">(</span>k<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; <span style="color: #adaab3;">y</span> = pickle.loads<span style="color: #2f96dc;">(</span>x<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; y
<span style="color: #2f96dc;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span><span style="color: #2f96dc;">]</span>
&gt;&gt;&gt; y == k
<span style="color: #a45bad;">1</span>
&gt;&gt;&gt; y <span style="color: #237fbf; font-weight: bold;">is</span> k
<span style="color: #a45bad;">0</span>
&gt;&gt;&gt; y <span style="color: #237fbf; font-weight: bold;">is</span> j
<span style="color: #a45bad;">0</span>
&gt;&gt;&gt; k <span style="color: #237fbf; font-weight: bold;">is</span> j
<span style="color: #a45bad;">1</span>
</pre>
</div>

<p>
同时，我们看到 Python 能够维护对象之间的引用，这些对象是作为一个单元进行 pickle 的。然而，我们还看到分别调用 dump() 会使 Python 无法维护对在该单元外部进行 pickle 的对象的引用。
相反，Python 复制了被引用对象，并将副本和被 pickle 的对象存储在一起。对于 pickle 和恢复单个对象层次结构的应用程序，这是没有问题的。但要意识到还有其它情形。
</p>

<p>
值得指出的是，有一个选项确实允许分别 pickle 对象，并维护相互之间的引用，只要这些对象都是 pickle 到同一文件即可。 pickle 和 cPickle 模块提供了一个 Pickler （与此相对应是 Unpickler ），
它能够跟踪已经被 pickle 的对象。通过使用这个 Pickler ，将会通过引用而不是通过值来 pickle 共享和循环引用：
</p>

<p>
清单 9. 维护分别 pickle 的对象间的引用
</p>
<pre class="example">
&gt;&gt;&gt; f = file('temp.pkl', 'w')
&gt;&gt;&gt; pickler = pickle.Pickler(f)
&gt;&gt;&gt; pickler.dump(a)
&lt;cPickle.Pickler object at 0x89b0bb8&gt;
&gt;&gt;&gt; pickler.dump(b)
&lt;cPickle.Pickler object at 0x89b0bb8&gt;
&gt;&gt;&gt; f.close()
&gt;&gt;&gt; f = file('temp.pkl', 'r')
&gt;&gt;&gt; unpickler = pickle.Unpickler(f)
&gt;&gt;&gt; c = unpickler.load()
&gt;&gt;&gt; d = unpickler.load()
&gt;&gt;&gt; c[2]
[3, 4, [1, 2, [...]]]
&gt;&gt;&gt; d[2]
[1, 2, [3, 4, [...]]]
&gt;&gt;&gt; c[2] is d
1
&gt;&gt;&gt; d[2] is c
1
</pre>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> 不可 pickle 的对象</h3>
<div class="outline-text-3" id="text-5-5">
<p>
一些对象类型是不可 pickle 的。例如，Python 不能 pickle 文件对象（或者任何带有对文件对象引用的对象），因为 Python 在 unpickle 时不能保证它可以重建该文件的状态（
另一个示例比较难懂，在这类文章中不值得提出来）。试图 pickle 文件对象会导致以下错误：
</p>

<p>
清单 10. 试图 pickle 文件对象的结果
</p>
<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #adaab3;">f</span> = <span style="color: #1f71ab;">file</span><span style="color: #2f96dc;">(</span><span style="color: #2aa198;">'temp.pkl'</span>, <span style="color: #2aa198;">'w'</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; <span style="color: #adaab3;">p</span> = pickle.dumps<span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>
Traceback <span style="color: #2f96dc;">(</span>most recent call last<span style="color: #2f96dc;">)</span>:
  File <span style="color: #2aa198;">"&lt;input&gt;"</span>, line <span style="color: #a45bad;">1</span>, <span style="color: #237fbf; font-weight: bold;">in</span> ?
  File <span style="color: #2aa198;">"/usr/lib/python2.2/copy_reg.py"</span>, line <span style="color: #a45bad;">57</span>, <span style="color: #237fbf; font-weight: bold;">in</span> _reduce
    <span style="color: #237fbf; font-weight: bold;">raise</span> <span style="color: #c56ec3; font-weight: bold;">TypeError</span>, <span style="color: #2aa198;">"can't pickle %s objects"</span> % base.<span style="color: #1f71ab;">__name__</span>
<span style="color: #c56ec3; font-weight: bold;">TypeError</span>: can<span style="color: #2aa198;">'t pickle file objects</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> 类实例</h3>
<div class="outline-text-3" id="text-5-6">
<p>
与 pickle 简单对象类型相比，pickle 类实例要多加留意。这主要由于 Python 会 pickle 实例数据（通常是 <span class="underline">dict</span> 属性）和类的名称，
而不会 pickle 类的代码。当 Python unpickle 类的实例时，它会试图使用在 pickle 该实例时的确切的类名称和模块名称（包括任何包的路径前缀）导入包含该类定义的模块。
另外要注意，类定义必须出现在模块的最顶层，这意味着它们不能是嵌套的类（在其它类或函数中定义的类）。
</p>

<p>
当 unpickle 类的实例时，通常不会再调用它们的 <span class="underline">init_() 方法。相反，Python 创建一个通用类实例，并应用已进行过 pickle 的实例属性，同时设置该实例的 _class</span> 属性，使其指向原来的类。
</p>

<p>
对 Python 2.2 中引入的新型类进行 unpickle 的机制与原来的略有不同。虽然处理的结果实际上与对旧型类处理的结果相同，但 Python 使用 copy_reg 模块的 _reconstructor() 函数来恢复新型类的实例。
</p>

<p>
如果希望对新型或旧型类的实例修改缺省的 pickle 行为，则可以定义特殊的类的方法 _getstate_() 和 _setstate_() ，在保存和恢复类实例的状态信息期间，Python 会调用这些方法。
在以下几节中，我们会看到一些示例利用了这些特殊的方法。
</p>

<p>
现在，我们看一个简单的类实例。首先，创建一个 persist.py 的 Python 模块，它包含以下新型类的定义：
</p>

<p>
清单 11. 新型类的定义
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #c56ec3; font-weight: bold;">Foo</span><span style="color: #2f96dc;">(</span><span style="color: #1f71ab;">object</span><span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, value<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.value = value
</pre>
</div>

<p>
现在可以 pickle Foo 实例，并看一下它的表示：
</p>

<p>
清单 12. pickle Foo 实例
</p>

<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #237fbf; font-weight: bold;">import</span> cPickle <span style="color: #237fbf; font-weight: bold;">as</span> pickle
&gt;&gt;&gt; <span style="color: #237fbf; font-weight: bold;">from</span> Orbtech.examples.persist <span style="color: #237fbf; font-weight: bold;">import</span> Foo
&gt;&gt;&gt; <span style="color: #adaab3;">foo</span> = Foo<span style="color: #2f96dc;">(</span><span style="color: #2aa198;">'What is a Foo?'</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; <span style="color: #adaab3;">p</span> = pickle.dumps<span style="color: #2f96dc;">(</span>foo<span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; <span style="color: #237fbf; font-weight: bold;">print</span> p
ccopy_reg
_reconstructor
p1
<span style="color: #2f96dc;">(</span>cOrbtech.examples.persist
Foo
p2
c__builtin__
<span style="color: #1f71ab;">object</span>
p3
NtRp4
<span style="color: #bc6ec5;">(</span>dp5
S<span style="color: #2aa198;">'value'</span>
p6
S<span style="color: #2aa198;">'What is a Foo?'</span>
sb.
&gt;&gt;&gt;
</pre>
</div>


<p>
可以看到这个类的名称 Foo 和全限定的模块名称 Orbtech.examples.persist 都存储在 pickle 中。如果将这个实例 pickle 成一个文件，稍后再 unpickle 它或在另一台机器上 unpickle，
则 Python 会试图导入 Orbtech.examples.persist 模块，如果不能导入，则会抛出异常。如果重命名该类和该模块或者将该模块移到另一个目录，则也会发生类似的错误
</p>

<p>
这里有一个 Python 发出错误消息的示例，当我们重命名 Foo 类，然后试图装入先前进行过 pickle 的 Foo 实例时会发生该错误：
</p>

<p>
清单 13. 试图装入一个被重命名的 Foo 类的经过 pickle 的实例
</p>
<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #237fbf; font-weight: bold;">import</span> cPickle <span style="color: #237fbf; font-weight: bold;">as</span> pickle
&gt;&gt;&gt; <span style="color: #adaab3;">f</span> = <span style="color: #1f71ab;">file</span><span style="color: #2f96dc;">(</span><span style="color: #2aa198;">'temp.pkl'</span>, <span style="color: #2aa198;">'r'</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; <span style="color: #adaab3;">foo</span> = pickle.load<span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>
Traceback <span style="color: #2f96dc;">(</span>most recent call last<span style="color: #2f96dc;">)</span>:
  File <span style="color: #2aa198;">"&lt;input&gt;"</span>, line <span style="color: #a45bad;">1</span>, <span style="color: #237fbf; font-weight: bold;">in</span> ?
<span style="color: #c56ec3; font-weight: bold;">AttributeError</span>: <span style="color: #2aa198;">'module'</span> <span style="color: #1f71ab;">object</span> has no attribute <span style="color: #2aa198;">'Foo'</span>
</pre>
</div>

<p>
在重命名 persist.py 模块之后，也会发生类似的错误：
</p>

<div class="org-src-container">

<pre class="src src-python">&gt;&gt;&gt; <span style="color: #237fbf; font-weight: bold;">import</span> cPickle <span style="color: #237fbf; font-weight: bold;">as</span> pickle
&gt;&gt;&gt; <span style="color: #adaab3;">f</span> = <span style="color: #1f71ab;">file</span><span style="color: #2f96dc;">(</span><span style="color: #2aa198;">'temp.pkl'</span>, <span style="color: #2aa198;">'r'</span><span style="color: #2f96dc;">)</span>
&gt;&gt;&gt; <span style="color: #adaab3;">foo</span> = pickle.load<span style="color: #2f96dc;">(</span>f<span style="color: #2f96dc;">)</span>
Traceback <span style="color: #2f96dc;">(</span>most recent call last<span style="color: #2f96dc;">)</span>:
  File <span style="color: #2aa198;">"&lt;input&gt;"</span>, line <span style="color: #a45bad;">1</span>, <span style="color: #237fbf; font-weight: bold;">in</span> ?
<span style="color: #c56ec3; font-weight: bold;">ImportError</span>: No module named persist
</pre>
</div>

<p>
我们会在下面 模式改进这一节提供一些技术来管理这类更改，而不会破坏现有的 pickle。
</p>
</div>
</div>
