python/base/对象持久话与pickle模块.html

<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> 特殊的状态方法</h3>
<div class="outline-text-3" id="text-5-7">
<p>
前面提到对一些对象类型（譬如，文件对象）不能进行 pickle。处理这种不能 pickle 的对象的实例属性时可以使用特殊的方法（ _getstate_() 和 _setstate_() ）来修改类实例的状态。
这里有一个 Foo 类的示例，我们已经对它进行了修改以处理文件对象属性：
</p>

<p>
清单 15. 处理不能 pickle 的实例属性
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #c56ec3; font-weight: bold;">Foo</span><span style="color: #2f96dc;">(</span><span style="color: #1f71ab;">object</span><span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, value, filename<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.value = value
        <span style="color: #237fbf; font-weight: bold;">self</span>.logfile = <span style="color: #1f71ab;">file</span><span style="color: #2f96dc;">(</span>filename, <span style="color: #2aa198;">'w'</span><span style="color: #2f96dc;">)</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__getstate__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span><span style="color: #2f96dc;">)</span>:
        <span style="color: #2aa198;">"""Return state values to be pickled."""</span>
        <span style="color: #adaab3;">f</span> = <span style="color: #237fbf; font-weight: bold;">self</span>.logfile
        <span style="color: #237fbf; font-weight: bold;">return</span> <span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>.value, f.name, f.tell<span style="color: #bc6ec5;">()</span><span style="color: #2f96dc;">)</span>
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__setstate__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, state<span style="color: #2f96dc;">)</span>:
        <span style="color: #2aa198;">"""Restore state from the unpickled state values."""</span>
        <span style="color: #237fbf; font-weight: bold;">self</span>.value, <span style="color: #adaab3;">name</span>, <span style="color: #adaab3;">position</span> = state
        <span style="color: #adaab3;">f</span> = <span style="color: #1f71ab;">file</span><span style="color: #2f96dc;">(</span>name, <span style="color: #2aa198;">'w'</span><span style="color: #2f96dc;">)</span>
        f.seek<span style="color: #2f96dc;">(</span>position<span style="color: #2f96dc;">)</span>
        <span style="color: #237fbf; font-weight: bold;">self</span>.logfile = f
</pre>
</div>

<p>
pickle Foo 的实例时，Python 将只 pickle 当它调用该实例的 _getstate_() 方法时返回给它的值。类似的，在 unpickle 时，Python 将提供经过 unpickle 的值作为参数传递给实例的 _setstate_() 方法。
在 _setstate_() 方法内，可以根据经过 pickle 的名称和位置信息来重建文件对象，并将该文件对象分配给这个实例的 logfile 属性。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 模式改进</h2>
<div class="outline-text-2" id="text-6">
<p>
随着时间的推移，您会发现自己必须要更改类的定义。如果已经对某个类实例进行了 pickle，而现在又需要更改这个类，则您可能要检索和更新那些实例，以便它们能在新的类定义下继续正常工作。
而我们已经看到在对类或模块进行某些更改时，会出现一些错误。幸运的是，pickle 和 unpickle 过程提供了一些 hook，我们可以用它们来支持这种模式改进的需要。
</p>

<p>
在这一节，我们将探讨一些方法来预测常见问题以及如何解决这些问题。由于不能 pickle 类实例代码，因此可以添加、更改和除去方法，而不会影响现有的经过 pickle 的实例。出于同样的原因，可以不必担心类的属性。
您必须确保包含类定义的代码模块在 unpickle 环境中可用。同时还必须为这些可能导致 unpickle 问题的更改做好规划，这些更改包括：更改类名、添加或除去实例的属性以及改变类定义模块的名称或位置。
</p>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> 类名的更改</h3>
<div class="outline-text-3" id="text-6-1">
<p>
要更改类名，而不破坏先前经过 pickle 的实例，请遵循以下步骤。首先，确保原来的类的定义没有被更改，以便在 unpickle 现有实例时可以找到它。不要更改原来的名称，而是在与原来类定义所在的同一个模块中，
创建该类定义的一个副本，同时给它一个新的类名。然后使用实际的新类名来替代 NewClassName ，将以下方法添加到原来类的定义中：
</p>

<p>
清单 16. 更改类名：添加到原来类定义的方法
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__setstate__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, state<span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">self</span>.__dict__.update<span style="color: #2f96dc;">(</span>state<span style="color: #2f96dc;">)</span>
    <span style="color: #237fbf; font-weight: bold;">self</span>.__class__ = NewClassName
</pre>
</div>

<p>
当 unpickle 现有实例时，Python 将查找原来类的定义，并调用实例的 <span class="underline">setstate_() 方法，同时将给新的类定义重新分配该实例的 _class</span> 属性。一旦确定所有现有的实例都已经 unpickle、更新和重新 pickle 后，
可以从源代码模块中除去旧的类定义。
</p>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> 属性的添加和删除</h3>
<div class="outline-text-3" id="text-6-2">
<p>
这些特殊的状态方法 _getstate_() 和 _setstate_() 再一次使我们能控制每个实例的状态，并使我们有机会处理实例属性中的更改。让我们看一个简单的类的定义，我们将向其添加和除去一些属性。这是是最初的定义
</p>

<p>
清单 17. 最初的类定义
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #c56ec3; font-weight: bold;">Person</span><span style="color: #2f96dc;">(</span><span style="color: #1f71ab;">object</span><span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, firstname, lastname<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.firstname = firstname
        <span style="color: #237fbf; font-weight: bold;">self</span>.lastname = lastname
</pre>
</div>

<p>
假定已经创建并 pickle 了 Person 的实例，现在我们决定真的只想存储一个名称属性，而不是分别存储姓和名。这里有一种方式可以更改类的定义，它将先前经过 pickle 的实例迁移到新的定义：
</p>

<p>
清单 18. 新的类定义
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #237fbf; font-weight: bold;">class</span> <span style="color: #c56ec3; font-weight: bold;">Person</span><span style="color: #2f96dc;">(</span><span style="color: #1f71ab;">object</span><span style="color: #2f96dc;">)</span>:
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, fullname<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">self</span>.fullname = fullname
    <span style="color: #237fbf; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__setstate__</span><span style="color: #2f96dc;">(</span><span style="color: #237fbf; font-weight: bold;">self</span>, state<span style="color: #2f96dc;">)</span>:
        <span style="color: #237fbf; font-weight: bold;">if</span> <span style="color: #2aa198;">'fullname'</span> <span style="color: #237fbf; font-weight: bold;">not</span> <span style="color: #237fbf; font-weight: bold;">in</span> state:
            <span style="color: #adaab3;">first</span> = <span style="color: #2aa198;">''</span>
            <span style="color: #adaab3;">last</span> = <span style="color: #2aa198;">''</span>
            <span style="color: #237fbf; font-weight: bold;">if</span> <span style="color: #2aa198;">'firstname'</span> <span style="color: #237fbf; font-weight: bold;">in</span> state:
                <span style="color: #adaab3;">first</span> = state<span style="color: #2f96dc;">[</span><span style="color: #2aa198;">'firstname'</span><span style="color: #2f96dc;">]</span>
                <span style="color: #237fbf; font-weight: bold;">del</span> state<span style="color: #2f96dc;">[</span><span style="color: #2aa198;">'firstname'</span><span style="color: #2f96dc;">]</span>
            <span style="color: #237fbf; font-weight: bold;">if</span> <span style="color: #2aa198;">'lastname'</span> <span style="color: #237fbf; font-weight: bold;">in</span> state:
                <span style="color: #adaab3;">last</span> = state<span style="color: #2f96dc;">[</span><span style="color: #2aa198;">'lastname'</span><span style="color: #2f96dc;">]</span>
                <span style="color: #237fbf; font-weight: bold;">del</span> state<span style="color: #2f96dc;">[</span><span style="color: #2aa198;">'lastname'</span><span style="color: #2f96dc;">]</span>
            <span style="color: #237fbf; font-weight: bold;">self</span>.fullname = <span style="color: #2aa198;">" "</span>.join<span style="color: #2f96dc;">(</span><span style="color: #bc6ec5;">[</span>first, last<span style="color: #bc6ec5;">]</span><span style="color: #2f96dc;">)</span>.strip<span style="color: #2f96dc;">()</span>
        <span style="color: #237fbf; font-weight: bold;">self</span>.__dict__.update<span style="color: #2f96dc;">(</span>state<span style="color: #2f96dc;">)</span>
</pre>
</div>

<p>
在这个示例，我们添加了一个新的属性 fullname ，并除去了两个现有的属性 firstname 和 lastname 。当对先前进行过 pickle 的实例执行 unpickle 时，
其先前进行过 pickle 的状态会作为字典传递给 _setstate_() ，它将包括 firstname 和 lastname 属性的值。接下来，将这两个值组合起来，并将它们分配给新属性 fullname 。
在这个过程中，我们删除了状态字典中旧的属性。更新和重新 pickle 先前进行过 pickle 的所有实例之后，现在可以从类定义中除去 _setstate_() 方法。
</p>
</div>
</div>



<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> 模块的修改</h3>
<div class="outline-text-3" id="text-6-3">
<p>
在概念上，模块的名称或位置的改变类似于类名称的改变，但处理方式却完全不同。那是因为模块的信息存储在 pickle 中，而不是通过标准的 pickle 接口就可以修改的属性。
事实上，改变模块信息的唯一办法是对实际的 pickle 文件本身执行查找和替换操作。至于如何确切地去做，这取决于具体的操作系统和可使用的工具。很显然，在这种情况下，您会想备份您的文件，
以免发生错误。但这种改动应该非常简单，并且对二进制 pickle 格式进行更改与对文本 pickle 格式进行更改应该一样有效。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 结束语</h2>
<div class="outline-text-2" id="text-7">
<p>
对象持久性依赖于底层编程语言的对象序列化能力。对于 Python 对象即意味着 pickle。Python 的 pickle 为 Python 对象有效的持久性管理提供了健壮的和可靠的基础。在下面的 参考资料中，
您将会找到有关建立在 Python pickle 能力之上的系统的信息。
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 参考资料</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> 本文参考</h3>
<div class="outline-text-3" id="text-8-1">
<p>
<a href="http://www.ibm.com/developerworks/cn/linux/l-pypers/">http://www.ibm.com/developerworks/cn/linux/l-pypers/</a>
</p>

<p>
<a href="http://baike.baidu.com/link?url=LPZEcwjwQMsR4KpuQmVEtvOLcJZBvZBS838r-ckC6sQH8eRfxT8c_bUJuKW2FdlWuuTwHBcXZSSle8MIy4oUt">http://baike.baidu.com/link?url=LPZEcwjwQMsR4KpuQmVEtvOLcJZBvZBS838r-ckC6sQH8eRfxT8c_bUJuKW2FdlWuuTwHBcXZSSle8MIy4oUt</a>_
</p>

<p>
<a href="http://blog.chinaunix.net/uid-12338792-id-2945149.html">http://blog.chinaunix.net/uid-12338792-id-2945149.html</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: huihui</p>
<p class="date">Created: 2015-12-15 二 19:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
